// 1. Коли у виразі є текстовий рядок та символ + , то js буде об'єднувати всі значення 
// результат: 'number33'
'number' + 3 + 3;

// 2. null - це нічого.
// нічого об'єднується з 3
// результат: 3
null + 3

// 3. && - оператор який повертає друге значення, якщо перше true.
// так як 5 - true
// результат: "qwerty"
5 && "qwerty"

// 4. Знак + перед рядком перетворює його в число, а + з рядком склеює в текст
// результат: "42hillel"
+'40' + +'2' + "hillel";

// 5. оператор - завжди працює з числами, а отже строка '10' перетвориться в число 10
// === - це строге порівняння, без приведення типів і приймає лише булеве значення
// результат: false
'10' - 5 === 6;

// 6. логічні значення при додаванні перетворюються в числа, тобто 1 + 0 = 1
// результат: 1
true + false

// 7. рядок з літерами при - буде намагатись перетворитись у число але з літерами так не вийде.
// Результат: NaN
'4px' - 3

// 8. строка 4 перетвориться в число
// результат: 1
'4' - 3

// 9. ** - це піднесення до степеня і виконується в першу чергу.
// оператор + робить склеювання і перетворення з числа в текст
// результат: 61
'6' + 3 ** 0;

// 10. тут виконується операція з діленням
// оператор / - працює з числами
// результат: 2
12 / '6'

// 11. === - лише булеві значення, а + працює з рядком і склеює результат
// результат: '10false'
'10' + (5 === 6);

// 12. null - це нічого, а == - порівняння яке працює з булевимми значеннями. Тут порівнюється нічого і пустий рядок
// результат: false
null == ''

// 13. Дія ділення що в дужках завжди виконується в першу чергу
// ** - піднесення до степеня
// результат: 27
3 ** (9 / 3);

// 14. В даному випадку 'false' і 'true' - рядки тексту
// !! - два логічних НЕ підряд
// результат: true
!!'false' == !!'true'

// 15. && - має вищий приорітет ніж оператор || (логічне АБО)
// результат: 1
0 || '0' && 1

// 16. +null - перетвориться у число 0 
// число 0 - це завжди false і при нестрогому порівнянні перетвориться в true, а true буде 1
// при порівнянні 1 < 1
// результат: false
(+null == false) < 1;

// 17. У першій частині прикладу повернеться false
// false || true - повертає true
// результат: true
false && true || true

// 18. У цьому прикладі спочатку виконається дія в дужках
// результат: false
false && (false || true);

// 19. Спочатку дія виконується у дужках і результат буде 0 == false - результат тут буде true
// при порівнянні 1 < 1 
// результат: false
(+null == false) < 1 ** 5;
